app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.ratings
    @sort = params[:sort]
    @selected_ratings = params[:ratings]
    if @selected_ratings.nil?
      @selected_ratings = {}
    end

    #user either just got here or did some "non action" action
    if (@sort.nil? and @selected_ratings=={})
      @search_session = true
    end

    #user clicked to sort by field name
    if !@sort.nil? or (@search_session and !session['sorted'].nil?)
      if @sort.nil?
        @sort = session['sorted']
      else
        session['sorted']=@sort
      end

      @movies = Movie.order(@sort)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY title

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "15"]]
UPDATE "movies" SET "title" = 'RESTful shit 2', "rating" = 'NC-17', "updated_at" = '2012-09-23 23:00:02.409896' WHERE "movies"."id" = 15